app/controllers/account_activations_controller.rb

    def edit
        muser = MUser.find_by(email: params[:email])
        if muser && !muser.activated? && muser.authenticated?(:activation, params[:id])
          muser.update_attribute(:activated,    true)
          muser.update_attribute(:activated_at, Time.zone.now)
---
SELECT  `m_users`.* FROM `m_users` WHERE `m_users`.`email` = 'ssa@gmail.com' LIMIT 1
UPDATE `m_users` SET `activated` = TRUE, `updated_at` = '2019-06-26 02:52:21' WHERE `m_users`.`id` = 2
UPDATE `m_users` SET `updated_at` = '2019-06-26 03:10:09', `activated_at` = '2019-06-26 03:10:09' WHERE `m_users`.`id` = 4