app/controllers/muser_controller.rb

INSERT INTO `m_users` (`user_name`, `email`, `created_at`, `updated_at`, `password_digest`, `activation_digest`) VALUES ('cna', 'cna@gmail.com', '2019-06-26 02:41:59', '2019-06-26 02:41:59', '$2a$12$y65CDQ6adpWFfkojNAV9DOtgUViKlhMXxxDeOZ8sWrPpgtO2sMmrG', '$2a$12$uaXsqXRY1Cj5kVAe.Y6GRewW7iPV3GmosG4QPA1n/lc9cK6YZ91Qy')
---
  def create
    @muser = MUser.new(user_params)    # Not the final implementation!
    if @muser.save

SELECT  `m_workspaces`.* FROM `m_workspaces` WHERE `m_workspaces`.`workspace_name` = 'Aye' LIMIT 1
SELECT  `m_users`.* FROM `m_users` WHERE `m_users`.`email` = 'aam@gmail.com' LIMIT 1
SELECT  `m_workspaces`.* FROM `m_workspaces` WHERE `m_workspaces`.`workspace_name` = 'Aye' LIMIT 1  [["workspace_name", "Aye"], ["LIMIT", 1]]
---
  def search
    mworkspace = MWorkspace.find_by(workspace_name: params[:workspace][:workspace_name])
    museremail=MUser.find_by(email: params[:workspace][:email].downcase)

    if mworkspace && museremail && museremail.authenticate(params[:workspace][:password])

      log mworkspace
      mworkspace = MWorkspace.find_by(workspace_name: session[:workspace_name])