app/controllers/sessions_controller.rb

SELECT  `m_users`.* FROM `m_users` WHERE `m_users`.`email` = 'ssa@gmail.com' LIMIT 1
---
  def create

    muser = MUser.find_by(email: params[:session][:email].downcase)

INSERT INTO `m_workspaces` (`user_id`, `workspace_name`, `admin`, `created_at`, `updated_at`) VALUES (10, 'W1', TRUE, '2019-06-27 05:23:24', '2019-06-27 05:23:24')
SELECT  `m_workspaces`.* FROM `m_workspaces` WHERE `m_workspaces`.`workspace_name` = 'W3' LIMIT 1
---
  def channelcreate
    @mworkspace = MWorkspace.new(workspace_params)
    @mworkspace.admin = 1
    @mworkspace.user_id = session[:muser_id]
    if @mworkspace.save
      session[:workspace_name] = @mworkspace.workspace_name
      mworkspace = MWorkspace.find_by(workspace_name: session[:workspace_name])