app/controllers/users_controller.rb

    def channel_chat

        channelchat = MChannel.find_by(id:params[:channel_id])
        channel channelchat
        @channel_msg_read = TChannelMsg.select("m_users.user_name,t_channel_msgs.channel_msg,t_channel_msgs.created_at").
                    joins("join m_users on t_channel_msgs.sender_id = m_users.id").
                    joins("join t_channel_unread_msgs on t_channel_msgs.id = t_channel_unread_msgs.channel_msg_id ").
                    where("t_channel_unread_msgs.unread = 0 and t_channel_msgs.channel_id = ?
                    and t_channel_unread_msgs.unread_user_id = ?", session[:channel_id], session[:muser_id])

        @channel_msg_unread = TChannelMsg.select("m_users.user_name,t_channel_msgs.channel_msg,t_channel_msgs.created_at").
                    joins("join m_users on t_channel_msgs.sender_id = m_users.id").
                    joins("join t_channel_unread_msgs on t_channel_msgs.id = t_channel_unread_msgs.channel_msg_id ").
                    where("t_channel_unread_msgs.unread = 1 and t_channel_msgs.channel_id = ?
                    and t_channel_unread_msgs.unread_user_id = ?", session[:channel_id], session[:muser_id])

        TChannelUnreadMsg.where(:unread_user_id=>session[:muser_id]).update_all(:unread=>0)
---
SELECT  `m_channels`.* FROM `m_channels` WHERE `m_channels`.`id` = 7 LIMIT 1
SELECT m_users.id, m_users.user_name FROM `m_users` join m_workspaces on m_users.id=m_workspaces.user_id WHERE (m_workspaces.id=29)
SELECT m_users.user_name,t_channel_msgs.channel_msg, t_channel_unread_msgs.unread FROM `t_channel_msgs` join m_users on t_channel_msgs.sender_id = m_users.id join t_channel_unread_msgs on t_channel_msgs.id = t_channel_unread_msgs.channel_msg_id WHERE (t_channel_unread_msgs.unread = 1 and t_channel_msgs.channel_id = '8'
SELECT sum(unread)as count,t_channel_msgs.channel_id FROM `t_channel_unread_msgs` join t_channel_msgs on t_channel_msgs.id=t_channel_unread_msgs.channel_msg_id WHERE (t_channel_unread_msgs.unread=1 and t_channel_unread_msgs.unread_user_id=3) GROUP BY t_channel_msgs.channel_id
INSERT INTO `m_channels` (`id`, `user_id`, `workspace_id`, `channel_name`, `status`, `created_at`, `updated_at`) VALUES (2, 5, 2, 'Channel2', TRUE, '2019-06-26 05:05:17', '2019-06-26 05:05:17')
UPDATE `t_channel_unread_msgs` SET `t_channel_unread_msgs`.`unread` = FALSE WHERE `t_channel_unread_msgs`.`unread_user_id` = 3

    def msgsend

        @channel_msg = TChannelMsg.new
        @channel_msg.channel_id = session[:channel_id]
        @channel_msg.sender_id = session[:muser_id]
        @channel_msg.channel_msg = params[:tchamsg][:msg]
        @channel_msg.save
        last_id = TChannelMsg.maximum("id")
        channel_memberlist
        @member_list.each do |memberlist|
            @channel_unread = TChannelUnreadMsg.new
            @channel_unread.channel_msg_id = last_id
            @channel_unread.unread_user_id = memberlist.userid
            @channel_unread.unread = 1
            @channel_unread.save
---
INSERT INTO `t_channel_msgs` (`channel_id`, `sender_id`, `channel_msg`, `created_at`, `updated_at`) VALUES (8, 3, 'hello', '2019-07-01 01:47:07', '2019-07-01 01:47:07')
INSERT INTO `m_channels` (`id`, `user_id`, `workspace_id`, `channel_name`, `status`, `created_at`, `updated_at`) VALUES (7, 5, 29, 'Channel7', TRUE, '2019-06-28 03:41:41', '2019-06-28 03:41:41')
SELECT MAX(`t_channel_msgs`.`id`) FROM `t_channel_msgs`
INSERT INTO `t_channel_unread_msgs` (`channel_msg_id`, `unread_user_id`, `unread`, `created_at`, `updated_at`) VALUES (32, 3, TRUE, '2019-07-01 06:48:13', '2019-07-01 06:48:13')
INSERT INTO `t_channel_msgs` (`channel_id`, `sender_id`, `channel_msg`, `created_at`, `updated_at`) VALUES (7, 3, 'hello channel 7', '2019-07-01 03:52:04', '2019-07-01 03:52:04')

    def dirchat
        diruser= MUser.find_by(id:params[:id])
        dir diruser
        @dir_msg_read = TDirectMsg.select("sender.user_name as s, receiver.user_name as r, t_direct_msgs.message, t_direct_msgs.created_at").
                    joins("join m_users as sender on t_direct_msgs.sender_id = sender.id").
                    joins("join m_users as receiver on t_direct_msgs.receiver_id = receiver.id ").
                    where("t_direct_msgs.unread=0 and (t_direct_msgs.sender_id = ?
                    and t_direct_msgs.receiver_id = ?
                    or t_direct_msgs.sender_id = ?
                    and t_direct_msgs.receiver_id = ?)
                    and t_direct_msgs.workspace_id = ?",
                     session[:diruser_id], session[:muser_id], session[:muser_id], session[:diruser_id], session[:workspace_id])

        @dir_msg_unread = TDirectMsg.select("m_users.user_name, t_direct_msgs.message, t_direct_msgs.created_at").
                     joins("join m_users on t_direct_msgs.sender_id = m_users.id").
                     where("t_direct_msgs.unread=1 and t_direct_msgs.sender_id = ?
                     and t_direct_msgs.receiver_id = ?
                     and t_direct_msgs.workspace_id = ?",
                      session[:diruser_id], session[:muser_id], session[:workspace_id])

        @dir_msg_sent = TDirectMsg.select("m_users.user_name, t_direct_msgs.message, t_direct_msgs.created_at").
                      joins("join m_users on t_direct_msgs.sender_id = m_users.id").
                      where("t_direct_msgs.unread=1 and t_direct_msgs.sender_id = ?
                      and t_direct_msgs.receiver_id = ?
                      and t_direct_msgs.workspace_id = ?",
                      session[:muser_id], session[:diruser_id], session[:workspace_id])

        TDirectMsg.where(:receiver_id=>session[:muser_id], :sender_id=>session[:diruser_id]).update(:unread=>0)
---
SELECT  `m_users`.* FROM `m_users` WHERE `m_users`.`id` IS NULL LIMIT 1
SELECT sender.user_name, receiver.user_name, t_direct_msgs.message, t_direct_msgs.created_at FROM `t_direct_msgs` join m_users as sender on t_direct_msgs.sender_id = sender.user_id join m_users as receiver on t_direct_msgs.receiver_id = receiver.user_id WHERE (t_direct_msgs.unread=0 and (t_direct_msgs.sender_id = 1
SELECT sum(unread) as count, m_users.user_name FROM `t_direct_msgs` join m_users on m_users.id=t_direct_msgs.sender_id WHERE (t_direct_msgs.unread=1 and t_direct_msgs.workspace_id=29
SELECT `m_users`.`user_name` FROM `m_users` WHERE (id=2)
UPDATE `t_direct_msgs` SET `t_direct_msgs`.`unread` = FALSE WHERE `t_direct_msgs`.`unread_user_id` = 3
SELECT `t_direct_msgs`.* FROM `t_direct_msgs` WHERE `t_direct_msgs`.`receiver_id` = 3 AND `t_direct_msgs`.`sender_id` = 2

    def dirmsgsend
        @dir_msg = TDirectMsg.new
        @dir_msg.sender_id = session[:muser_id]
        @dir_msg.receiver_id = session[:diruser_id]
        @dir_msg.workspace_id = session[:workspace_id]
        @dir_msg.message = params[:dirmsg][:msg]
        @dir_msg.unread = 1
        @dir_msg.save
---
INSERT INTO `t_direct_msgs` (`sender_id`, `receiver_id`, `workspace_id`, `message`, `unread`, `created_at`, `updated_at`) VALUES (3, 2, 29, 'hello set gyi', TRUE, '2019-07-01 08:51:34', '2019-07-01 08:51:34')

    def add
        user_id = params[:user_id]
        @add = MChannel.new(:id=>7, :user_id=>user_id, :workspace_id=>session[:workspace_id], :channel_name=>"Channel7", :status=>1)
        @add.save
---
INSERT INTO `m_channels` (`id`, `user_id`, `workspace_id`, `channel_name`, `status`, `created_at`, `updated_at`) VALUES (2, 5, 2, 'Channel2', TRUE, '2019-06-26 05:05:17', '2019-06-26 05:05:17')

    def remove
        member_id=params[:user_id]
        MChannel.where(:id=>7, :user_id=>member_id).delete_all
---
DELETE FROM `m_channels` WHERE `m_channels`.`id` = 2 AND `m_channels`.`user_id` = 3
SELECT  `m_channels`.* FROM `m_channels` WHERE `[:id, :user_id]`.`id` = 2 AND `[:id, :user_id]`.`user_id` = 3 LIMIT 1

    def admin
        admin_id=params[:user_id]
        MWorkspace.where(:id=>session[:workspace_id],:user_id=>admin_id).update_all(:admin=>admin_id)
---
SELECT  `m_workspaces`.* FROM `m_workspaces` WHERE `[:id, :user_id]`.`id` = 2 AND `[:id, :user_id]`.`user_id` = 1 LIMIT 1
UPDATE `m_workspaces` SET `m_workspaces`.`admin` = TRUE WHERE `m_workspaces`.`id` = 2 AND `m_workspaces`.`user_id` = 1

    def managemember
        list
        @admin=MWorkspace.select("user_id").joins("join m_users on m_users.id=m_workspaces.user_id").
                where("m_workspaces.admin=1 and m_workspaces.id=?",session[:workspace_id])
---
SELECT `m_workspaces`.`user_id` FROM `m_workspaces` join m_users on m_users.id=m_workspaces.user_id WHERE (m_workspaces.admin=1 and m_workspaces.id=29)
SELECT m_users.id, m_users.user_name FROM `m_users` join m_workspaces on m_users.id=m_workspaces.user_id WHERE (m_workspaces.id=29)